a5021/stm32-async-1wire/src/ds18b20.c
    case 5: // REQUEST - Check presence and send read command
        // Verify DS18B20 presence again
        if (check_presence()) {
            // Device present - send read scratchpad command,
            // addressing all devices (Skip ROM) or the selected one (Match ROM)
            if (ctx.address_mode) {
                build_addr_cmd(DS18B20_READ_SCRATCHPAD);
                send_command_n(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
            } else {
                send_command(read_cmd);
            }
            // Transition to READ state
            ctx.current_state = 6;
        } else {
            // No device present - report error and pause
            ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
            // Start inter-measurement pause
            start_cycle_pause();
            // Return to IDLE state
            ctx.current_state = 0;
        }
        break;

    case 6: // READ - Read scratchpad data from sensor
        // Initiate scratchpad data read using timer capture and DMA
        read_data();
        // Transition to DECODE state
        ctx.current_state = 7;
        break;

    case 7: // DECODE - Process received data and report temperature
        // Decode captured pulse durations into scratchpad bytes
        decode_scratchpad();
        // Turn off LED to indicate measurement complete
        ds18b20_busy(0);

        // Validate CRC and report temperature or error
        if (ctx.scratchpad[8] == check_scratchpad_crc()) {
            // CRC valid - decode and report temperature
            ds18b20_complete(decode_temperature());
        } else {
            // CRC invalid - report error
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
        }

        // Start inter-measurement pause period
        start_cycle_pause();
        // Return to IDLE state for next measurement cycle
        ctx.current_state = 0;
        break;

    default:
        // Unexpected state - report generic error
        ds18b20_complete(DS18B20_TEMP_ERROR_GENERIC);
        // Return to IDLE state
        ctx.current_state = 0;
        break;
    }
}

/**
 * @brief Kick the non-blocking state machine so the next poll() starts a cycle
 * @note The blocking search clears the timer update flag on every operation,
 *       which would otherwise leave the state machine waiting forever for the
 *       UIF that idles in state 0. Setting UIF here restores the original
 *       behaviour where the first poll() after startup began a measurement.
 */
__STATIC_FORCEINLINE void kick_state_machine(void) {
    T1.EGR = TIM_EGR(UG);
    __DSB();
}

/**
 * @brief Search the 1-Wire bus and report every device ROM address
 * @param[in] sink Callback invoked once per found device with its 64-bit ROM
 *                 address (LSB first). May be NULL to only count devices.
 *                 Return non-zero from the callback to stop the search early.
 * @param[in] max_devices Maximum number of devices to report (0 aborts)
 * @return Number of devices found on the bus
 * @note Blocking - intended for one-time use at startup. Implements the
 *       standard Maxim 1-Wire Search ROM (0xF0) algorithm with the
 *       last-discrepancy method and CRC-8 validation.
 */
uint8_t ds18b20_search_devices(uint8_t (*sink)(const uint8_t* rom), uint8_t max_devices) {
    uint8_t rom[DS18B20_ROM_BYTES] = {0};
    uint8_t found = 0;
    uint8_t last_device = 0;
    uint16_t last_discrepancy = 0;

    if (max_devices == 0) {
        return 0;
    }

    // Repeat the search until every device has been enumerated
    while (!last_device && found < max_devices) {
        // A reset + presence pulse is required before EVERY Search ROM pass:
        // after a completed search transaction the found device is left
        // selected (waiting for a function command) and the other devices go
        // into a "not participating" state, so only a reset brings them all
        // back to search mode. Omitting it stops the search after the first
        // device (verified on 5x DS18B20 hardware).
        if (!search_reset()) {
            // No device answered - reset and stop the search
            last_discrepancy = 0;
            break;
        }

        send_byte(DS18B20_SEARCH_ROM);

        uint16_t id_bit_number = 1;
        uint16_t last_zero = 0;
        for (uint8_t byte_idx = 0; byte_idx < DS18B20_ROM_BYTES; byte_idx++) {
            uint8_t mask = 1;
            for (uint8_t bit_idx = 0; bit_idx < DS18B20_BITS_PER_BYTE; bit_idx++) {
                uint8_t id_bit, cmp_bit, direction;
                read_2bits(&id_bit, &cmp_bit);
                if (id_bit && cmp_bit) {
                    // No device follows this path - search tree exhausted
                    kick_state_machine();
                    return found;
                }
                if (id_bit != cmp_bit) {
                    // Single device on this path - its bit fixes the direction
                    direction = id_bit;
                } else if (id_bit_number < last_discrepancy) {
                    // Follow the previously taken path
                    direction = (rom[byte_idx] & mask) ? 1u : 0u;
                    if (direction == 0) {
                        // Remember the last 0-branch taken at a discrepancy
                        last_zero = id_bit_number;
                    }
                } else {
                    // At the discrepancy point take the '1' branch first
                    direction = (id_bit_number == last_discrepancy) ? 1u : 0u;
                    if (direction == 0) {
                        // Remember the last 0-branch taken at a discrepancy
                        last_zero = id_bit_number;
                    }
                }
                if (direction) {
                    rom[byte_idx] |= mask;
                } else {
                    rom[byte_idx] &= (uint8_t)~mask;
                }
                write_bit(direction);
                id_bit_number++;
                mask <<= 1;
            }
        }
        last_discrepancy = last_zero;

        // Validate the assembled ROM address
        if (crc8_calc(rom, DS18B20_ROM_BYTES) != 0) {
            break;
        }

        // Only report DS18B20 devices; other 1-Wire families share the bus
        // but are not temperature sensors and must not be measured as one.
        if (rom[0] != DS18B20_FAMILY_CODE) {
            if (last_discrepancy == 0) {
                last_device = 1; // This was the last device on the bus
            }
            continue;
        }

        found++;
        if (sink && sink(rom)) {
            break; // Callback requested an early stop
        }
        if (last_discrepancy == 0) {
            last_device = 1; // This was the last device on the bus
        }
    }

    // Kick the non-blocking state machine (see kick_state_machine)
    kick_state_machine();
    return found;
}

/**
 * @}
 */
